Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/index.html.txt.tmx
Source language: en
Languages: ga

source: Prisons and Places of Detention
ga: Priosuin agus aiteanna coinneala

source: Description of the types of prisons and centres currently in use
ga: Ta cur sios deanta anseo ar phriosuin agus aiteanna coinneala sa stait

source: Admission, placement and transfer in prisons
ga: Ag ligean isteach, ag glacadh agus ag aistriú priosunaithe

source: This document describes admission, placement and transfer from prisons
ga: Deantar cur sios ar ag ligean isteach,ag glacadh agus ag aistriu priosunaithe sa doicimead seo

source: The main source of prisoners' rights is the Prison Rules 2007. Find out more
ga: Deantar cur sios sa doicimead seo ar na cearta ata ag priosunaithe

source: There are rules in place governing the conditions in prisons
ga: Deantar cur sios sa doicimead seo ar choinniollacha priosuin

source: Prison medical services consist of medical, dental, psychiatric and psychological care
ga: Deantar cur sios sa doicimead seo ar na seirbhisi leighis ata ar fail i bpriosun

source: More than half of all prisoners participate in education. Find out about services and options available in the prison system
ga: Tá cur síos déanta sa doiciméad seo ar sheirbhísí oideachais phríosúin laistigh de chóras phríosúin

source: Sex offenders treatment programmes
ga: Cláir Chóireála do Chiontóirí Gnéis

source: A new sex offender management policy was introduced in 2009 for sex offenders in Irish prisons
ga: Tá beartas bainistíochta ciontóirí gnéis tugtha isteach do chiontóirí gnéis i bpríosúin na hÉireann

source: Arbour Hill was designated as a national centre and there are two satellite centres
ga: Tá Cnoc an Arbhair ainmnithe mar ionad náisiúnta agus tá dhá ionad satailíte ann

source: Remission and temporary release from prison
ga: Nuair a chuirtear breith ar leataobh agus scaoileadh saor sealadach

source: Find out what the terms remission and temporary release mean and the rules in place regarding prisoners
ga: Deantar cur sios sa doicimead seo ar nuair a chuirtear breith ar leataobh agus scaoileadh saor sealadach

source: Parole Board of Ireland
ga: Bord Parúil na hÉireann

source: The Parole Board of Ireland reviews the cases of prisoners in Ireland who have been sentenced to fixed-term sentences of 8 years or more
ga: Déanann Bord Parúil na hÉireann athbhreithniú ar chásanna príosúnach in Éirinn a bhfuil téarmaí socraithe de 8 mbliana nó níos mó gearrtha orthu

source: Visiting someone in prison
ga: Cuairt a thabhairt ar duine sa phríosún

source: You can visit a family member or friend in prison
ga: Is féidir leat cuairt a thabhairt ar dhuine muinteartha nó ar chara sa phríosún

source: Supports for families of prisoners
ga: Tacaí do theaghlach príosúnach

source: There are a small number of organisations that provide information or support to families affected by imprisonment
ga: Tá roinnt bheag eagraíochtaí a chuireann faisnéis agus tacaíocht ar fáil do theaghlaigh a dtéann príosúnacht i bhfeidhm orthu

source: Irish prisoners overseas face significant difficulties and in some jurisdictions prison conditions and safety can be a major cause of concern
ga: Bíonn príosúnaigh na hÉireann thíos le deacrachtaí suntasacha agus i ndlínsí áirithe, d’fhéadfadh coinníollacha agus sábháilteacht phríosúin bheith ina n-údar mór buartha

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
